Repository: muhammadGagah/native-speech-generation
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: id, uk

source: Open the Native Speech Generation dialog
id: Membuka add-on Native Speech Generation
uk: Відкриває діалог генерації природної мови

source: Native Speech Generation
uk: Генерація природної мови

source: The Native Speech Generation add-on has been installed successfully. To use this add-on, you must obtain a Gemini API key from Google AI Studio and enter it in the add-on's settings (NVDA Menu -> Tools -> Native Speech Generation). To run the Native Speech Generation add-on, you can press the shortcut NVDA+Control+Shift+G (this can be changed via NVDA Menu -> Preferences -> Input Gestures, under the Native Speech Generation category). Please note that this add-on bundles external libraries. If you encounter any issues, please ensure your NVDA version is compatible.
uk: Додаток Генерація природної мови успішно встановлено. Щоб скористатися цим додатком, необхідно отримати ключ Gemini API від Google AI Studio та ввести його в налаштуваннях додатка (меню NVDA -> Інструменти -> Генерація природної мови). Щоб запустити додаток Native Speech Generation, натисніть комбінацію клавіш NVDA+Control+Shift+G (її можна змінити в меню NVDA -> Налаштування -> Жести вводу, у категорії Генерація природної мови). Зверніть увагу, що цей додаток містить зовнішні бібліотеки. Якщо у вас виникли проблеми, переконайтеся, що ваша версія NVDA сумісна.

source: Native Speech Generation Installation Complete
uk: Встановлення додатка Генерація природної мови встановлено

source: Restart Required
id: Restart diperlukan
uk: Потрібен перезапуск

source: Audio generated, but failed to play automatically: {error}
id: Audio dihasilkan, tetapi gagal diputar secara otomatis: {error}
uk: Аудіофайл створено, але не вдалося відтворити автоматично: {error}

source: Info
uk: Інформація

source: &GEMINI API Key:
uk: &Ключ API Gemini:

source: &How to get API Key...
id: &Cara Mendapatkan Kunci API...
uk: &Як отримати ключ API ...

source: Native Speech Generation (Gemini TTS)
uk: Генерація природної мови (Gemini TTS)

source: &Type text to convert here:
id: &Masukkan teks yang ingin anda jadikan audio:
uk: &Введіть тут текст для перетворення:

source: &Style instructions (optional):
id: &Gaya bicara TTS (optional):
uk: &Інструкції щодо стилю (за бажанням):

source: Select &Model:
id: Pilih &Model:
uk: Виберіть модель:

source: Flash (Standard Quality)
id: Flash (kualitas standar)
uk: Flash (стандартна якість)

source: Pro (High Quality)
id: Pro (kualitas tinggi)
uk: Pro (висока якість)

source: Single-speaker
id: Satu pembicara
uk: Одномовний

source: Multi-speaker (2)
id: Multi pembicara
uk: Багатомовний (2)

source: Advanced Settings (&Temperature)
id: Pengaturan lanjutan (&Temperature)
uk: Розширені налаштування (&тембр)

source: Temperature:
uk: Тембр:

source: &Generate Speech
id: &Hasilkan Audio
uk: &Генерувати мовлення

source: &Play
id: &Putar
uk: &Грати

source: Save &Audio
id: Simpan &Audio
uk: Зберегти &аудіо

source: API Key Settings
id: Pengaturan Kunci API
uk: Налаштування ключа API

source: View voices in AI Studio
id: Periksa Suara di AI Studio
uk: Переглянути голоси в AI Studio

source: &Close
id: &Tutup
uk: &Закрити

source: Select &Voice:
id: Pilih &Suara:
uk: Вибрати & Голос:

source: Loading voices...
id: Memuat suara ...
uk: Завантаження голосів ...

source: Speaker 1 Name:
id: Nama Pembicara 1:
uk: Голос 1 Ім'я:

source: Voice:
id: Suara:
uk: Голос:

source: Speaker 2 Name:
id: Nama Pembicara 2:
uk: Голос2 Ім'я:

source: &Gemini API Key:
id: & Kunci API Gemini:
uk: &Ключ API Gemini:

source: Show API Key
id: Tampilkan kunci API
uk: Показати ключ API

source: &Reinstall Libraries
id: &Instal ulang Librarys
uk: &Перевстановити бібліотеки

source: This will delete the existing library and restart NVDA to redownload it. Are you sure?
id: Tindakan ini akan menghapus library yang ada dan restart NVDA untuk mengunduhnya ulang. Apakah kamu yakin?
uk: Це призведе до видалення існуючої бібліотеки та перезапуску NVDA для її повторного завантаження. Ви впевнені?

source: Confirm Reinstall
id: Konfirmasikan Instal Ulang
uk: Підтвердити перевстановлення

source: Library removed successfully. NVDA will now restart to download the latest version.
id: Library berhasil dihapus. NVDA sekarang akan memulai ulang untuk mengunduh versi terbaru.
uk: Бібліотеку успішно видалено. Тепер NVDA перезапуститься, щоб завантажити останню версію.

source: Error
id: Kesalahan
uk: Помилка

source: Talk With &AI
id: Bicara Dengan & AI
uk: Розмова з &ШІ

source: Talk With AI module is missing.
id: Modul Bicara Dengan AI tidak ada.
uk: Модуль «Розмова з ШІ» відсутній.

source: google-genai library not installed. Install with: pip install google-genai
uk: бібліотека google-genai не встановлена. Встановіть за допомогою: pip install google-genai

source: No GEMINI_API_KEY configured. Set it in NVDA settings under NativeSpeechGeneration.
uk: Не налаштовано ключ_GEMINI_API. Налаштуйте його в налаштуваннях NVDA в розділі Генерація природної мови.

source: Please enter text to generate.
id: Harap masukkan teks terlebih dahulu.
uk: Будь ласка, введіть текст для генерації.

source: Generating...
id: Sedang memproses...
uk: Генерувати...

source: Generating speech, please wait...
id: Sedang menghasilkan audio, harap tunggu...
uk: Генерація мовлення, будь ласка, зачекайте...

source: Feature Limitation
id: Batasan Fitur
uk: Обмеження функцій

source: No GEMINI_API_KEY configured.
id: Tidak ada GEMINI_API_KEY yang dimasukkan, silahkan atur terlebih dahulu.
uk: Ключ_API_GEMINI не налаштовано.

source: Failed to open Talk With AI: {error}
id: Gagal membuka Bicara Dengan AI: {error}
uk: Не вдалося відкрити «Розмова з ШІ»: {error}

source: google-genai library not installed. Please restart NVDA.
id: perpustakaan Google-Genai tidak diinstal. Harap restart NVDA.
uk: бібліотека google-genai не встановлена. Перезапустіть NVDA.

source: No GEMINI_API_KEY configured. Set it in NVDA settings.
id: Tidak ada kunci API Gemini yang anda masukkan. Silahkan atur terlebih dahulu di pengaturan NVDA, kategory NativeSpeechGeneration.
uk: GEMINI_API_KEY не налаштовано. Встановіть його в налаштуваннях NVDA.

source: Failed to initialize Google GenAI client: {error}
id: Gagal menginisialisasi klien Google Genai: {error}
uk: Не вдалося ініціалізувати клієнт Google GenAI: {error}

source: Failed to generate audio.
id: Gagal menghasilkan audio.
uk: Не вдалося створити аудіо.

source: Generation complete.
id: Selesai membuat audio.
uk: Генерація завершена.

source: Please select a voice for Speaker 1.
uk: Будь ласка, Виберіть голос для диктора 1.

source: Please select voices for both speakers.
uk: Будь ласка, виберіть голоси для обох дикторів.

source: An error occurred during generation.
id: Terjadi kesalahan selama menghasilkan audio.
uk: Під час генерації сталася помилка.

source: An unexpected error occurred: {error}
id: Terjadi kesalahan yang tidak terduga: {error}
uk: Сталася несподівана помилка: {error}

source: No inline audio data returned by model.
id: Tidak ada data audio inline yang dikembalikan oleh model.
uk: Модель не повертає вбудованих аудіоданих.

source: Failed to generate speech: {error}
id: Gagal menghasilkan ucapan: {error}
uk: Не вдалося згенерувати мовлення: {error}

source: No audio available to play.
uk: Аудіофайл недоступний для відтворення.

source: No generated audio to save.
uk: Немає згенерованого аудіо для збереження.

source: Save Audio File
id: Simpan file audio
uk: Зберегти аудіофайл

source: Audio saved to {path}
id: Audio disimpan ke {path}
uk: Аудіо збережено в {path}

source: Success
uk: Успіх

source: Failed to save audio: {error}
id: Gagal menyimpan audio: {error}
uk: Не вдалося зберегти аудіо: {error}

source: No voice selected
uk: Жодного голосу не вибрано

source: Sample not available
id: Suara sampel tidak tersedia
uk: Зразок недоступний

source: Playing voice sample
id: Memainkan sampel suara
uk: Відтворення зразка голосу

source: Failed to play sample
id: Gagal memainkan sampel audio
uk: Не вдалося відтворити зразок

source: &Native Speech Generation
uk: &Генерація природної мови

source: Generate speech using Gemini TTS
id: Hasilkan Ucapan Menggunakan Gemini TTS
uk: Генерувати мовлення за допомогою Gemini TTS

source: The Native Speech Generation add-on is already open. Please close the dialog before opening it again.
id: Add-on Native Speech Generation sudah terbuka. Harap tutup dialog sebelum membukanya lagi.
uk: Додаток Генерація природної мови вже відкрито. Закрийте діалог, перш ніж відкривати його знову.

source: Add-on Already Running
id: Add-on sudah berjalan
uk: Додаток вже запущено

source: Failed to open Native Speech Generation dialog: {error}
id: Gagal menjalankan add-on Native Speech Generation: {error}
uk: Не вдалося відкрити діалог«Генерація природної мови»: {error}

source: NativeSpeechGeneration
uk: Генерація природної мови

source: Downloading libraries...
id: Mengunduh library ...
uk: Завантаження бібліотек...

source: Downloading...
id: Mengunduh ...
uk: Завантаження...

source: Extracting libraries...
id: Mengekstraksi library yang diperlukan ...
uk: Видобування бібліотек...

source: Extraction complete.
id: Ekstraksi selesai.
uk: Видобування завершено.

source: Failed to download or extract required libraries. The add-on might not work correctly. Error: {error}
id: Gagal mengunduh atau mengekstrak pustaka yang diperlukan. Add-on mungkin tidak berfungsi dengan benar. Kesalahan: {error}
uk: Не вдалося завантажити або видобути необхідні бібліотеки. Додаток може не працювати належним чином. Помилка: {error}

source: Installing Dependencies
id: Menginstal dependensi
uk: Встановлення залежностей

source: Checking for required libraries...
id: Memeriksa library yang diperlukan ...
uk: Перевірка необхідних бібліотек...

source: Installation complete!
id: Instalasi selesai!
uk: Встановлення завершено!

source: The Native Speech Generation libraries have been successfully installed/updated. Please restart NVDA for the changes to take effect.
id: Library Native Speech Generation telah berhasil dipasang/diperbarui. Silakan mulai ulang NVDA agar perubahan diterapkan.
uk: Бібліотеки генерації природної мови успішно встановлено/оновлено. Перезапустіть NVDA, щоб зміни набули чинності.

source: Installation Complete
id: Instalasi Selesai
uk: Встановлення завершено

source: Library installation failed. Please check the log.
id: Instalasi lib gagal. Silakan periksa lognya.
uk: Помилка встановлення бібліотеки. Будь ласка, перевірте журнал.

source: Are you sure you want to reinstall the libraries? This will redownload the dependencies and require an NVDA restart.
id: Apakah Anda yakin ingin menginstal ulang lib? Ini akan mengunduh ulang dependensi dan memerlukan restart NVDA.
uk: Ви впевнені, що бажаєте перевстановити бібліотеки? Це призведе до повторного завантаження залежностей і потребує перезапуску NVDA.

source: Required libraries for Native Speech Generation are missing. Click OK to download them.
id: Library yang diperlukan untuk menjalankan add-on Native Speech Generation tidak ada. Klik OK untuk mengunduhnya.
uk: Відсутні необхідні бібліотеки для генерації мовлення. Натисніть OK, щоб завантажити їх.

source: Missing Dependencies
id: Kehilangan dependensi
uk: Відсутні залежності

source: Talk With AI
id: Bicara Dengan AI
uk: Розмова з ШІ

source: PyAudio library is not installed. This feature requires PyAudio.
id: Perpustakaan PyAudio tidak diinstal. Fitur ini memerlukan PyAudio.
uk: Бібліотека PyAudio не встановлена. Для цієї функції потрібен PyAudio.

source: Google GenAI library is not installed.
id: Pustaka Google GenAI tidak terpasang.
uk: Бібліотека Google GenAI не встановлена.

source: Status
uk: Статус

source: Ready to Connect
id: Siap Terhubung
uk: Готовий до підключення

source: Controls
uk: Елементи керування

source: Start Conversation
id: Mulai Percakapan
uk: Розпочати розмову

source: Stop Conversation
id: Akhiri Percakapan
uk: Зупинити розмову

source: Microphone: ON
id: Mikrofon: AKTIF
uk: Мікрофон: УВІМК

source: Microphone:
uk: Мікрофон:

source: Speaker:
uk: Динаміки:

source: Grounding with Google Search
id: Grounding dengan Google Search
uk: Перевірка за допомогою пошуку Google

source: Volume:
uk: Гучність:

source: Voice:
id: Suara:
uk: Голос:

source: Status:
uk: Статус:

source: Microphone: OFF
id: Mikrofon: NONAKTIF
uk: Мікрофон: ВИМК

source: Connecting...
id: Menghubungkan...
uk: Підключення...

source: Disconnecting...
id: Memutuskan koneksi...
uk: Відключення...

source: Connected
id: Terhubung
uk: Підключено

source: Connection Lost. Retrying...
id: Koneksi Hilang. Mencoba lagi...
uk: З’єднання втрачено. Повторна спроба...

source: Ready
id: Siap
uk: Готовий

source: Harness the power of Google's state-of-the-art Gemini AI for high-quality speech generation directly within NVDA. This add-on provides a user-friendly dialog to convert text into natural-sounding audio. Key Features: - High-Quality Voices: Choose between Gemini Pro for premium, life-like speech and Gemini Flash for standard quality, responsive generation. - Single and Multi-Speaker Modes: Easily generate audio for a single speaker or create dynamic dialogues with two distinct speakers. Simply format your text with "SpeakerName:" to assign voices. - Advanced Voice Control: Fine-tune the output by adjusting the temperature for more creative or stable results, and provide custom style instructions. - Accessible Interface: All controls are fully accessible, including a collapsible panel for advanced settings to keep the interface clean and easy to navigate. - Seamless Workflow: The add-on provides instant audio playback upon generation and allows you to save the resulting .wav file for later use. To get started, obtain a Gemini API key from Google AI Studio and enter it in the add-on's settings panel, found under NVDA's Tools menu.
id: Manfaatkan kekuatan AI Gemini canggih dari Google untuk menghasilkan suara berkualitas tinggi langsung di dalam NVDA. Add-on ini menyediakan dialog yang ramah pengguna untuk mengubah teks menjadi audio yang terdengar alami. Fitur Utama: - Suara Berkualitas Tinggi: Pilih antara Gemini Pro untuk suara premium yang mirip dengan kehidupan nyata dan Gemini Flash untuk kualitas standar yang responsif. - Mode Satu dan Multi-Pembicara: Dengan mudah hasilkan audio untuk satu pembicara atau buat dialog dinamis dengan dua pembicara yang berbeda. Cukup format teks Anda dengan "NamaPembicara:" untuk menetapkan suara. - Kontrol Suara Lanjutan: Sesuaikan output dengan mengatur temperature untuk hasil yang lebih kreatif atau stabil, dan berikan instruksi gaya pembicara sesuai keinginan. - Antarmuka yang Dapat Diakses: Semua kontrol sepenuhnya dapat diakses, termasuk panel yang dapat diciutkan untuk pengaturan lanjutan agar antarmuka tetap bersih dan mudah dinavigasi. - Alur Kerja yang Lancar: Add-on ini menyediakan pemutaran audio instan setelah pembuatan dan memungkinkan Anda menyimpan file .wav yang dihasilkan untuk digunakan nanti. Untuk memulai, dapatkan kunci API Gemini dari Google AI Studio dan masukkan ke dalam panel pengaturan add-on, yang dapat ditemukan di menu Alat NVDA.
uk: Використовуйте потужність найсучаснішої технології Google Gemini AI для високоякісної генерації мови безпосередньо в NVDA. Цей додаток надає зручний діалог для перетворення тексту в природне мовлення. Ключові особливості: - Високоякісні голоси: вибирайте між Gemini Pro для преміум-якості, реалістичної мови та Gemini Flash для стандартної якості, чутливої генерації. - Режими одного та декількох голосів: легко генеруйте аудіо для одного голосу або створюйте динамічні діалоги з двома різними голосами. Просто відформатуйте текст за допомогою «ім'я голосу:», щоб призначити голоси. - Розширене керування голосом: точно налаштуйте вихід, регулюючи тембр для більш креативних або стабільних результатів, та надайте інструкції щодо стилю. - Доступний інтерфейс: всі елементи керування повністю доступні, включаючи складану панель для розширених налаштувань, щоб інтерфейс залишався чітким і простим у навігації. - Безперебійний робочий процес: додаток забезпечує миттєве відтворення аудіо після генерації та дозволяє зберегти отриманий файл .wav для подальшого використання. Щоб розпочати роботу, отримайте ключ API Gemini від Google AI Studio та введіть його в панелі налаштувань додатка, яка знаходиться в меню «Інструменти» NVDA.

source: Native Speech Generation is installing dependencies. Please restart NVDA for the changes to take effect.
id: Sedang memasang dependensi Native Speech Generation. Harap restart NVDA agar perubahan berlaku.

source: Talk With AI currently does not support multi-speaker mode. Please select Single-speaker.
id: Talk With AI saat ini tidak mendukung mode multi-speaker. Harap pilih singgle speaker.

source: - Reverting the lib updator code due to SSL issues - Now talkWithAI has a feature to change the input and output used.
id: - Mengembalikan kode pembaruan lib karena masalah SSL - Kini talkWithAI memiliki fitur untuk mengubah input dan output yang digunakan.
