Repository: MuhammadGagah/native-speech-generation
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ru

source: Could not find the installation script. Please reinstall the add-on.
ru: Не удалось найти скрипт установки. Пожалуйста, переустановите дополнение.

source: Error
ru: Ошибка

source: Open the Native Speech Generation dialog
ru: Открыть диалог Нативной генерации речи

source: Native Speech Generation
ru: Нативная генерация речи

source: Native Speech Generation is installing dependencies. Please restart NVDA for the changes to take effect.
ru: Нативная генерация речи устанавливает зависимости. Пожалуйста, перезагрузите NVDA, чтобы изменения вступили в силу.

source: Restart Required
ru: Требуется перезагрузка

source: Audio generated, but failed to play automatically: {error}
ru: Аудио сгенерировано, но не удалось воспроизвести автоматически: {error}

source: Info
ru: Информация

source: &Gemini API Key:
ru: &Ключ API Gemini:

source: Show API Key
ru: Показать ключ API

source: &How to get API Key...
ru: &Как получить ключ API...

source: Native Speech Generation (Gemini TTS)
ru: Нативная генерация речи (Gemini TTS)

source: &Type text to convert here:
ru: &Введите текст для преобразования:

source: &Style instructions (optional):
ru: &Инструкции по стилю (необязательно):

source: Select &Model:
ru: Выбрать &модель:

source: Flash (Standard Quality)
ru: Flash (стандартное качество)

source: Pro (High Quality)
ru: Pro (высокое качество)

source: Single-speaker
ru: Один говорящий

source: Multi-speaker (2)
ru: Несколько говорящих (2)

source: Advanced Settings (&Temperature)
ru: Расширенные настройки (&температура)

source: Temperature:
ru: Температура:

source: &Generate Speech
ru: &Сгенерировать речь

source: &Play
ru: &Воспроизвести

source: Save &Audio
ru: Сохранить &аудио

source: API Key Settings
ru: Настройки ключа API

source: View voices in AI Studio
ru: Просмотреть голоса в AI Studio

source: &Close
ru: &Закрыть

source: Select &Voice:
ru: Выбрать &голос:

source: Loading voices...
ru: Загрузка голосов...

source: Speaker 1 Name:
ru: Имя говорящего 1:

source: Voice:
ru: Голос:

source: Speaker 2 Name:
ru: Имя говорящего 2:

source: google-genai library not installed. Please restart NVDA.
ru: Библиотека google-genai не установлена. Пожалуйста, перезагрузите NVDA.

source: No GEMINI_API_KEY configured. Set it in NVDA settings.
ru: Ключ GEMINI_API_KEY не настроен. Установите его в настройках NVDA.

source: Please enter text to generate.
ru: Пожалуйста, введите текст для генерации.

source: Generating...
ru: Генерация...

source: Generating speech, please wait...
ru: Идёт генерация речи, пожалуйста, подождите...

source: Failed to initialize Google GenAI client: {error}
ru: Не удалось инициализировать клиент Google GenAI: {error}

source: Failed to generate audio.
ru: Не удалось сгенерировать аудио.

source: Generation complete.
ru: Генерация завершена.

source: An error occurred during generation.
ru: Во время генерации произошла ошибка.

source: An unexpected error occurred: {error}
ru: Произошла непредвиденная ошибка: {error}

source: No inline audio data returned by model.
ru: Модель не вернула встроенные аудиоданные.

source: Failed to generate speech: {error}
ru: Не удалось сгенерировать речь: {error}

source: Save Audio File
ru: Сохранить аудиофайл

source: Audio saved to {path}
ru: Аудио сохранено в {path}

source: Success
ru: Успешно

source: Failed to save audio: {error}
ru: Не удалось сохранить аудио: {error}

source: Sample not available
ru: Образец недоступен

source: Playing voice sample
ru: Воспроизведение образца голоса

source: Failed to play sample
ru: Не удалось воспроизвести образец

source: &Native Speech Generation
ru: &Нативная генерация речи

source: Generate speech using Gemini TTS
ru: Генерация речи с использованием Gemini TTS

source: The Native Speech Generation add-on is already open. Please close the dialog before opening it again.
ru: Дополнение «Нативная генерация речи» уже открыто. Пожалуйста, закройте диалог перед повторным открытием.

source: Add-on Already Running
ru: Дополнение уже запущено

source: Failed to open Native Speech Generation dialog: {error}
ru: Не удалось открыть диалог «Нативная генерация речи»: {error}

source: Dependencies already satisfied.
ru: Зависимости уже удовлетворены.

source: Downloading libraries...
ru: Загрузка библиотек...

source: Downloading...
ru: Загрузка...

source: Extracting libraries...
ru: Извлечение библиотек...

source: Extraction complete.
ru: Извлечение завершено.

source: Failed to download or extract required libraries. The add-on might not work correctly. Error: {error}
ru: Не удалось загрузить или извлечь необходимые библиотеки. Дополнение может работать некорректно. Ошибка: {error}

source: Installing Dependencies
ru: Установка зависимостей

source: Checking for required libraries...
ru: Проверка необходимых библиотек...

source: Installation complete!
ru: Установка завершена!

source: The Native Speech Generation add-on has been installed successfully. To use this add-on, you must obtain a Gemini API key from Google AI Studio and enter it in the add-on's settings (NVDA Menu -> Preferences -> Settings -> Native Speech Generation). To open the generation dialog, you can press the shortcut NVDA+Control+Shift+G (this can be changed via NVDA Menu -> Preferences -> Input Gestures).
ru: Дополнение «Нативная генерация речи» было успешно установлено. Для использования этого дополнения необходимо получить ключ API Gemini из Google AI Studio и ввести его в настройках дополнения (Меню NVDA -> Параметры -> Настройки -> Нативная генерация речи). Чтобы открыть диалог генерации, нажмите комбинацию клавиш NVDA+Control+Shift+G (это можно изменить через Меню NVDA -> Параметры -> Жесты ввода).

source: Native Speech Generation Installation Complete
ru: Установка «Нативной генерации речи» завершена

source: Dependency installation failed. The Native Speech Generation add-on might not work correctly. Please review the log for errors.
ru: Установка зависимостей не удалась. Дополнение «Нативная генерация речи» может работать некорректно. Пожалуйста, проверьте журнал на наличие ошибок.

source: Installation Warning
ru: Предупреждение при установке

source: Required libraries for Native Speech Generation are missing. They will be downloaded and installed now. Click OK to continue.
ru: Отсутствуют необходимые библиотеки для «Нативной генерации речи». Они будут загружены и установлены сейчас. Нажмите OK для продолжения.
